# Дана строка, состоящая из слов, разделенных пробелами.
# Определите, сколько в ней слов. Используйте для решения задачи метод coun.
s = input("Ведите предложение : ")
d = s.split()
print("Колличество слов : ", len(d))